import { ContentComponent } from "@/components/content.component";
import { Content } from "@/interfaces/content";

export default async function MantraPushpa() {
  const contents: Array<Content> = [
    {
      details: [
        {
          list: [
            "ಯೋsಪಾಂ ಪುಷ್ಪಂ ವೇದ",
            "ಪುಷ್ಪವಾನ್ ಪ್ರಜಾವಾನ್ ಪಶುಮಾನ್ ಭವತಿ |",
            "ಚಂದ್ರಮಾ ವಾ ಅಪಾಂ ಪುಷ್ಪಮ್ |",
            "ಪುಷ್ಪವಾನ್ ಪ್ರಜಾವಾನ್ ಪಶುಮಾನ್ ಭವತಿ |",
            "ಯ ಏವಂ ವೇದ | ಯೋsಪಾಮಾಯತನಂ ವೇದ | ಆಯತನವಾನ್ ಭವತಿ |",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ಅಗ್ನಿರ್ವಾ ಅಪಾಮಾಯತನಮ್ |",
            "ಆಯತನವಾನ್ ಭವತಿ | ",
            "ಯೋಗ್ನೇರಾಯತನಂ ವೇದ |",
            "ಆಯತನವಾನ್ ಭವತಿ | ",
            "ಆಪೋವಾ ಅಗ್ನೇರಾಯತನಮ್ | ",
            "ಆಯತನವಾನ್ ಭವತಿ | ",
            "ಯ ಏವಂ ವೇದ | ಯೋsಪಾಮಾಯತನಂ ವೇದ | ಆಯತನವಾನ್ ಭವತಿ |",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ವಾಯುರ್ವಾ ಅಪಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯೋ ವಾಯೋರಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಆಪೋ ವೈ ವಾಯೋರಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯ ಏವಂ ವೇದ",
            "ಯೋಽಪಾಮಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ಅಸೌ ವೈ ತಪನ್ನಪಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯೋಽಮುಷ್ಯತಪತಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಆಪೋ ವಾ ಅಮುಷ್ಯತಪತಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯ ಏವಂ ವೇದ",
            "ಯೋಽಪಾಮಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ಚಂದ್ರಮಾ ವಾ ಅಪಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯಃ ಚಂದ್ರಮಸ ಆಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಆಪೋ ವೈ ಚಂದ್ರಮಸ ಆಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯ ಏವಂ ವೇದ",
            "ಯೋಽಪಾಮಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ನಕ್ಷತ್ರಾಣಿ ವಾ ಅಪಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯೋ ನಕ್ಷತ್ರಾಣಾಮಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಆಪೋ ವೈ ನಕ್ಷತ್ರಾಣಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯ ಏವಂ ವೇದ",
            "ಯೋಽಪಾಮಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ಪರ್ಜನ್ಯೋ ವಾ ಅಪಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯಃ ಪರ್ಜನ್ಯಸ್ಯಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಆಪೋ ವೈ ಪರ್ಜನ್ಯಸ್ಯಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯ ಏವಂ ವೇದ",
            "ಯೋಽಪಾಮಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ಸಂವತ್ಸರೋ ವಾ ಅಪಾಮಾಯತನಮ್",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯಃ ಸಂವತ್ಸರಸ್ಯಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಆಪೋ ವೈ ಸಂವತ್ಸರಸ್ಯಾಯತನಂ ವೇದ",
            "ಆಯತನವಾನ್ ಭವತಿ",
            "ಯ ಏವಂ ವೇದ",
            "ಯೋಽಪ್ಸು ನಾವಂ ಪ್ರತಿಷ್ಠಿತಾಂ ವೇದ",
            "ಪ್ರತ್ಯೇವ ತಿಷ್ಠತಿ",
          ],
        },
      ],
    },
    {
      details: [
        {
          list: [
            "ಓಂ ರಾಜಾಧಿರಾಜಾಯ ಪ್ರಸಹ್ಯ ಸಾಹಿನೇ",
            "ನಮೋ ವಯಂ ವೈಶ್ರವಣಾಯ ಕುರ್ಮಹೇ",
            "ಸ ಮೇ ಕಾಮಾನ್ ಕಾಮಕಾಮಾಯ ಮಹ್ಯಂ",
            "ಕಾಮೇಶ್ವರೋ ವೈಶ್ರವಣೋ ದದಾತು",
            "ಕುಬೇರಾಯ ವೈಶ್ರವಣಾಯ",
            "ಮಹಾರಾಜಾಯ ನಮಃ",
          ],
        },
      ],
    },
  ];

  return <ContentComponent contents={contents} />;
}
