import { ContentComponent } from "@/components/content.component";
import { Content } from "@/interfaces/content";

export default async function GanapatiUpanishath() {
  const contents: Array<Content> = [
    {
      details: [
        {
          paragraph:
            "ಓಂ ನಮಸ್ತೇ ಗಣಪತಯೇ | ತ್ವಮೇವ ಪ್ರತ್ಯಕ್ಷಂ ತತ್ವಮಸಿ | ತ್ವಮೇವ ಕೇವಲಂ ಕರ್ತಾಽಸಿ | ತ್ವಮೇವ ಕೇವಲಂ ಧರ್ತಾಽಸಿ | ತ್ವಮೇವ ಕೇವಲಂ ಹರ್ತಾಽಸಿ | ತ್ವಮೇವ ಸರ್ವಂ ಖಲ್ವಿದಂ ಬ್ರಹ್ಮಾಸಿ | ತ್ವಂ ಸಾಕ್ಷಾದಾತಮಾಽಸಿ ನಿತ್ಯಮ್ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph: "ಋತಂ ವಚ್ಮಿ | ಸತ್ಯಂ ವಚ್ಮಿ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಅವ ತ್ವಂ ಮಾಮ್‌ | ಅವ ವಕ್ತಾರಮ್‌ | ಅವ ಶ್ರೋತಾರಮ್‌ | ಅವ ದಾತಾರಮ್‌ | ಅವ ಧಾತಾರಮ್‌ | ಅವಾನೂಚಾನ ಮಮ ಶಿಷ್ಯಮ್‌ | ಅವ ಪಶ್ಚಾತ್ತಾತ್‌ | ಅವ ಪುರಸ್ತಾತ್‌ | ಅವೋತ್ತರಾತ್ತಾತ್‌ | ಅವ ದಕ್ಷಿಣಾತ್ತಾತ್‌ | ಅವ ಚೋರ್ಧ್ವಾತ್ತಾತ್‌ | ಅವಾಧರಾತ್ತಾತ್‌ | ಸರ್ವತೋ ಮಾಂ ಪಾಹಿ ಪಾಹಿ ಸಮಂತಾತ್‌ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ತ್ವಂ ವಾಂಙ್ಮಯಸ್ತ್ವಂ ಚಿನ್ಮಯ: | ತ್ವಮಾನಂದಮಯಸ್ತ್ವಂ ಬ್ರಹ್ಮಮಯ: | ತ್ವಂ ಸಚ್ಚಿದಾನಂದಾಽದ್ವಿತೀಯೋಽಸಿ | ತ್ವಂ ಪ್ರತ್ಯಕ್ಷಂ ಬ್ರಹ್ಮಾಸಿ | ತ್ವಂ ಜ್ಞಾನಮಯೋ ವಿಜ್ಞಾನಮಯೋಸಿ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಸರ್ವಂ ಜಗದಿದಂ ತ್ವತ್ತೋ ಜಾಯತೇ | ಸರ್ವಂ ಜಗದಿದಂ ತ್ವತ್ತಸ್ತಿಷ್ಠತಿ | ಸರ್ವಂ ಜಗದಿದಂ ತ್ವಯಿಲಯ ಮೇಷ್ಯತಿ | ಸರ್ವಂ ಜಗದಿದಂ ತ್ವಯಿ ಪ್ರತ್ಯೇತಿ | ತ್ವಂ ಭೂಮಿರಾಪೋಽನಲೋಽನಿಲೋ ನಭ: | ತ್ವಂ ಚತ್ವಾರಿ ವಾಕ್ಪದಾನಿ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ತ್ವಂ ಗುಣತ್ರಯಾತೀತಃ | ತ್ವಂ ಅವಸ್ಥಾತ್ರಯಾತೀತಃ | ತ್ವಂ ದೇಹತ್ರಯಾತೀತಃ | ತ್ವಂ ಕಾಲತ್ರಯಾತೀತಃ | ತ್ವಂ ಮೂಲಾಧಾರಸ್ಥಿತೋಽಸಿ ನಿತ್ಯಮ್‌ | ತ್ವಂ ಶಕ್ತಿತ್ರಯಾತ್ಮಕಃ | ತ್ವಾಂ ಯೋಗಿನೋ ಧ್ಯಾಯಂತಿ ನಿತ್ಯಮ್‌ | ತ್ವಂ ಬ್ರಹ್ಮಾ ತ್ವಂ ವಿಷ್ಣುಸ್ತ್ವಂ ತ್ವಂ ರುದ್ರಸ್ತ್ವ ಮಿಂದ್ರಸ್ವಂ ವಾಯುಸ್ತ್ವಂ ಸೂರ್ಯಾರ್ಸ್ತ್ವಂ ಚಂದ್ರಮಾಸ್ತ್ವಂ ಬ್ರಹ್ಮ ಭೂರ್ಭುವಃ ಸ್ವರೋಮ್‌ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಗಣಾದಿಂ ಪೂರ್ವ ಮುಚ್ಚಾರ್ಯ ವರ್ಣಾದೀಂ ಸ್ತದನಂತರಮ್‌ | ಅನುಸ್ವಾರಃ ಪರತರಃ | ಅರ್ಧೇಂದುಲಸಿತಮ್‌ | ತಾರೇಣ ಋದ್ಧಮ್‌ | ಏತತ್ತವ ಮನುಸ್ವರೂಪಮ್‌ | ಗಕಾರಃ ಪೂರ್ವ ರೂಪಮ್‌ | ಅಕಾರೋ ಮಧ್ಯಮ ರೂಪಮ್‌ | ಅನುಸ್ವಾರಶ್ಚಾಂತ್ಯ ರೂಪಮ್‌ | ಬಿಂದುರುತ್ತರ ರೂಪಮ್‌ | ನಾದಃ ಸಂಧಾನಮ್‌ | ಸಗ್‌ಂಹಿತಾ ಸಂಧಿಃ | ಸೈಷಾ ಗಣೇಶ ವಿದ್ಯಾ | ಗಣಕ ಋಷಿ: | ನಿಚರದ್‌ ಗಾಯತ್ರೀ ಛಂದಃ | ಶ್ರೀ ಮಹಾಗಣಪತಿರ್ದೇವತಾ | ಓಂ ಗಂ ಗಣಪತಯೇ ನಮ: ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಓಂ ಏಕದಂತಾಯ ವಿದ್ಮಹೇ ವಕ್ರತುಂಡಾಯ ಧೀಮಹೀ | ತನ್ನೋ ದಂತಿಃ ಪ್ರಚೋದಯಾತ್ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಏಕದಂತಂ ಚತುರ್ಹಸ್ತಂ ಪಾಶಮಂ ಕುಶಧಾರಿಣಮ್‌ | ಋದಂ ಚ ವರದಂ ಹಸ್ತೈರ್ಭಿಭ್ರಾಣಂ ಮೂಷಕಧ್ವಜಮ್‌ | ರಕ್ತಂ ಲಂಬೋದರಂ ಶೂರ್ಪಕರ್ಣಕಂ ರಕ್ತವಾಸಸಮ್‌ | ರಕ್ತ ಗಂಧಾನು ಲಿಪ್ತಾಂಗಂ ರಕ್ತ ಪುಷ್ಪೈಃ ಸುಪೂಜಿತಮ್‌ | ಭಕ್ತಾನುಕಂಪಿನಂ ದೇವಂ ಜಗತ್ಕಾರಣ ಮಚ್ಯುತಮ್‌ | ಆವಿರ್ಭೂತಂ ಚ ಸೃಷ್ಟ್ಯಾದೌ ಪ್ರಕೃತೇಃ ಪುರುಷಾತ್ಪರಮ್‌ | ಏವಂ ಧ್ಯಾಯತಿ ಯೋ ನಿತ್ಯಂ ಸ ಯೋಗೀ ಯೋಗಿನಾಂ ವರಃ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ನಮೋ ವ್ರಾತಪತಯೇ ನಮೋ ಗಣಪತಯೇ ನಮಃ ಪ್ರಮಥಪತಯೇ ನಮಸ್ತೇ ಅಸ್ತು ಲಂಬೋದರಾಯೈಕದಂತಾಯ ವಿಘ್ನವಿನಾಶಿನೇ ಶಿವಸುತಾಯ ಶ್ರೀ ವರದಮೂರ್ತಯೇ ನಮಃ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಏತದಥರ್ವಶೀರ್ಷಂ ಯೋಽಧೀತೇ | ಸಃ ಬ್ರಹ್ಮ ಭೂಯಾಯ ಕಲ್ಪತೇ | ಸ ಸರ್ವ ವಿಘ್ನೈರ್ನ ಬಾಧ್ಯತೇ | ಸ ಸರ್ವತಃ ಸುಖ ಮೇಧತೇ | ಸ ಪಂಚ ಮಹಾಪಾಪಾತ್‌ ಪ್ರಮುಚ್ಯತೇ | ಸಾಯಮಧೀಯಾನೋ ದಿವಸಕೃತಂ ಪಾಪಂ ನಾಶಯತಿ | ಪ್ರಾತರಧೀಯಾನೋ ರಾತ್ರಿಕೃತಂ ಪಾಪಂ ನಾಶಯತಿ | ಸಾಯಂ ಪ್ರಾತಃ ಪ್ರಯುಂಜಾನೋ ಪಾಪೋಽಪಾಪೋ ಭವತಿ | ಧರ್ಮಾರ್ಥ ಕಾಮ ಮೋಕ್ಷಂ ಚ ವಿಂದತಿ | ಇದಮಥರ್ವಶೀರ್ಷಮಶಿಷ್ಯಾಯ ನ ದೇಯಮ್‌ | ಯೋ ಯದಿ ಮೋಹಾತ್‌ ದಾಸ್ಯತಿ ಸ ಪಾಪಿಯಾನ್ ಭವತಿ | ಸಹಸ್ರಾವರ್ತನಾತ್ ಯಂ ಯಂ ಕಾಮಮಧೀತೇ | ತಂ ತಮನೇನ ಸಾಧಯೇತ್‌ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಅನೇನ ಗಣಪತಿರ್ಮಭಿಷಿಂಚತಿ | ಸ ವಾಗ್ಮೀ ಭವತಿ | ಚತುರ್ಥ್ಯಾಮನಶ್ನಂಜಪತಿ ಸ ವಿದ್ಯಾವಾನ್ ಭವತಿ | ಇತ್ಯಥರ್ವಣ ವಾಕ್ಯಮ್‌ | ಬ್ರಹ್ಮಾದ್ಯಾಚರಣಂ ವಿದ್ಯಾನ್ನಭಿಭೇತಿ ಕದಾಚನೇತಿ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಯೋ ದೂರ್ವಾಂಕುರೈರ್ಯಜತಿ | ಸ ವೈಶ್ರವಣೋ ಪಮೋ ಭವತಿ | ಯೋ ಲಾರ್ಜೈರ್ಯಜತಿ | ಸ ಯಶೋವಾನ್ ಭವತಿ | ಸ ಮೇಧಾವಾನ್ ಭವತಿ | ಯೋ ಮೋದಕ ಸಹಸ್ರೇಣ ಯಜತಿ | ಸ ವಾಂಛಿತಫಲಮವಾಪ್ನೋತಿ | ಯಃ ಸಾಜ್ಯ ಸಮಿದ್ಭಿರ್ಯಜತಿ | ಸ ಸರ್ವಂ ಲಭತೇ ಸ ಸರ್ವಂ ಲಭತೇ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಅಷ್ಟೌ ಬ್ರಾಹ್ಮಣಾನ್‌ ಸಮ್ಯಗ್‌ ಗ್ರಾಹಯಿತ್ವಾ ಸೂರ್ಯವರ್ಚಸ್ವೀ ಭವತಿ | ಸುರ್ಯ ಗ್ರಹೇ ಮಹಾನದ್ಯಾಂ ಪ್ರತಿಮಾ ಸನ್ನಿಧೌ ವಾ ಜಪ್ತ್ವಾ ಸಿದ್ಧಮಂತ್ರೋ ಭವತಿ | ಮಹಾ ವಿಘ್ನಾತ್ ಪ್ರಮುಚ್ಯತೇ | ಮಹಾ ದೋಷಾತ್ ಪ್ರಮುಚ್ಯತೇ | ಮಹಾ ಪಾಪಾತ್ ಪ್ರಮುಚ್ಯತೇ | ಮಹಾ ಪ್ರತ್ಯವಾಯಾತ್ ಪ್ರಮುಚ್ಯತೇ | ಸ ಸರ್ವ ವಿದ್ಭವತಿ ಸ ಸರ್ವ ವಿದ್ಭವತಿ | ಯ ಏವಂ‌ ವೇದಾ | ಇತ್ಯುಪನಿಷತ್‌ ||",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಓಂ ಭದ್ರಂ ಕರ್ಣೇಭಿಃ ಶೃಣುಯಾಮ ದೇವಾಃ | ಭದ್ರಂ ಪಶ್ಯೇಮಾಕ್ಷಭಿರ್ಯಜತ್ರಾಃ | ಸ್ಥಿರೈರಂಗೈಸ್ತುಷ್ಟುವಾಗ್‌ಂ ಸಸ್ತನೂಭಿಃ | ವ್ಯಶೇಮ ದೇವಹಿತಂ ಯದಾಯುಃ | ಸ್ವಸ್ತಿ ನ ಇಂದ್ರೋ ವೃದ್ಧಶ್ರವಾಃ | ಸ್ವಸ್ತಿ ನಃ ಪೂಷಾ ವಿಶ್ವವೇದಾಃ | ಸ್ವಸ್ತಿ ನಸ್ತಾರ್ಕ್ಷ್ಯೋ ಅರಿಷ್ಟನೇಮಿಃ | ಸ್ವಸ್ತಿ ನೋ ಬೃಹಸ್ಪತಿರ್ದಧಾತು |",
        },
      ],
    },
    {
      details: [
        {
          paragraph: "ಓಂ ಶಾಂತಿಃ ಶಾಂತಿಃ ಶಾಂತಿಃ |",
        },
      ],
    },
    {
      details: [
        {
          paragraph:
            "ಓಂ ಸಹ ನಾವವತು | ಸಹ ನೌ ಭುನಕ್ತು | ಸಹವೀರ್ಯಂಕರ ವಾವಹೈ | ತೇಜಸ್ವಿನಾವಧೀ ತಮಸ್ತು | ಮಾವಿಧ್ವಿಷಾವಹೈ || ಓಂ ಶಾಂತಿಃ ಶಾಂತಿಃ ಶಾಂತಿಃ ||",
        },
      ],
    },
  ];

  return <ContentComponent contents={contents} />;
}
